_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ЗакрытиеОбъектаСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_ЗакрытиеОбъектаСтроительства</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТоваровОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.СебестоимостьТоваров</xr:Item>
				<xr:Item>InformationRegister.ОтражениеДокументовВРеглУчете</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>InformationRegister.ОтражениеДокументовВМеждународномУчете</xr:Item>
				<xr:Item>AccumulationRegister.СвободныеОстатки</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.УСОERP_НДСИнвестиционный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВосстанавливатьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатратНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатратПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатратВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьПроектная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьФактическая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратПР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратВР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ВидыОперацийСОбъектамиСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПринятиеКУчету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьПроектная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьФактическая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратПР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратВР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаУчетаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СдачаИнвестору</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьПроектная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьФактическая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратПР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратВР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРасчетов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВосстановлениеНДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСтроительства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСписанияНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ЗакрытиеОбъектаСтроительства/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПолучениеДанных

// Функция получает данные и возвращает таблицу значений для заполнения сведений о восстановлении НДС.
//
Функция ПолучитьДанныеЗаполненияВосстановленияНДС(СтруктураПараметров) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаДокумента"		, СтруктураПараметров.ДатаДокумента);
	Запрос.УстановитьПараметр("Организация"			, СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("ОбъектСтроительства"	, СтруктураПараметров.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Счет"				, СтруктураПараметров.Счет);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	УчетнаяПолитика.СчетУчетаИнвестиционногоНДС КАК СчетУчетаИнвестиционногоНДС
	               |ПОМЕСТИТЬ ВТУчетнаяПолитика
	               |ИЗ
	               |	РегистрСведений.УСОERP_УчетнаяПолитикаПоДолевомуСтроительству.СрезПоследних(&ДатаДокумента, Организация = &Организация) КАК УчетнаяПолитика
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	СчетУчетаИнвестиционногоНДС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НДСИнвестиционный.Контрагент КАК Контрагент,
	               |	НДСИнвестиционный.ДокументПоступления КАК ДокументПоступления,
	               |	НДСИнвестиционный.Номенклатура КАК Номенклатура,
	               |	НДСИнвестиционный.СчетУчетаНДС КАК СчетУчетаНДС,
	               |	ВЫБОР
	               |		КОГДА НДСИнвестиционный.СуммаБезНДСРасход ЕСТЬ NULL 
	               |				ИЛИ НДСИнвестиционный.СуммаНДСРасход ЕСТЬ NULL 
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
	               |		КОГДА НДСИнвестиционный.СуммаБезНДСРасход = 0
	               |				ИЛИ НДСИнвестиционный.СуммаНДСРасход = 0
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |		КОГДА (ВЫРАЗИТЬ(НДСИнвестиционный.СуммаНДСРасход / НДСИнвестиционный.СуммаБезНДСРасход КАК ЧИСЛО(15, 2))) = 0.18
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |		КОГДА (ВЫРАЗИТЬ(НДСИнвестиционный.СуммаНДСРасход / НДСИнвестиционный.СуммаБезНДСРасход КАК ЧИСЛО(15, 2))) = 0.1
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
	               |	КОНЕЦ КАК СтавкаНДС,
	               |	НДСИнвестиционный.СуммаБезНДСРасход КАК СуммаБезНДС,
	               |	НДСИнвестиционный.СуммаНДСРасход КАК СуммаНДС,
	               |	НДСИнвестиционный.СпособСтроительства КАК СпособСтроительства,
	               |	&Счет КАК СчетСписанияНДС,
	               |	НДСИнвестиционный.ОбъектСтроительства КАК ОбъектСтроительства
	               |ИЗ
	               |	РегистрНакопления.УСОERP_НДСИнвестиционный.Обороты(
	               |			,
	               |			&ДатаДокумента,
	               |			,
	               |			Организация = &Организация
	               |				И ОбъектСтроительства = &ОбъектСтроительства
	               |				И СчетУчетаНДС В
	               |					(ВЫБРАТЬ
	               |						ВТУчетнаяПолитика.СчетУчетаИнвестиционногоНДС
	               |					ИЗ
	               |						ВТУчетнаяПолитика КАК ВТУчетнаяПолитика)) КАК НДСИнвестиционный";
				   
	Возврат Запрос.Выполнить().Выгрузить();			   
				   
КонецФункции // ПолучитьДанныеЗаполненияВосстановленияНДС()

// Функция получает данные и возвращает выборку данных для заполнения сведений о хозрасчетных суммах остатка.
//
Функция ПолучитьДанныеПоОстаткамХозрасчетного(СтруктураПараметров) Экспорт

	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаДокумента"		, СтруктураПараметров.ДатаДокумента);
	Запрос.УстановитьПараметр("Организация"			, СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("ОбъектСтроительства"	, СтруктураПараметров.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Счет"				, СтруктураПараметров.Счет);
	Запрос.УстановитьПараметр("МассивСубконто"		, МассивСубконто);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ХозрасчетныйОстатки.СуммаОстаток КАК СуммаЗатрат,
	               |	ХозрасчетныйОстатки.СуммаНУОстаток КАК СуммаЗатратНУ,
	               |	ХозрасчетныйОстатки.СуммаПРОстаток КАК СуммаЗатратПР,
	               |	ХозрасчетныйОстатки.СуммаВРОстаток КАК СуммаЗатратВР
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(
	               |			&ДатаДокумента,
	               |			Счет = &Счет,
	               |			&МассивСубконто,
	               |			Организация = &Организация
	               |				И Субконто1 = &ОбъектСтроительства) КАК ХозрасчетныйОстатки";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;

КонецФункции // ПолучитьДанныеПоОстаткамХозрасчетного()	

// Функция получает данные и возвращает таблицу значений для заполнения сведений об объектах недвижимости.
//
Функция ПолучитьДанныеЗаполненияОбъектовНедвижимости(СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаДокумента"		, СтруктураПараметров.ДатаДокумента);
	Запрос.УстановитьПараметр("ОбъектСтроительства"	, СтруктураПараметров.ОбъектСтроительства);
	Запрос.УстановитьПараметр("ПлощадьФактическая"	, СтруктураПараметров.ПлощадьФактическая);
	Запрос.УстановитьПараметр("СуммаЗатрат"			, СтруктураПараметров.СуммаЗатрат);
	Запрос.УстановитьПараметр("СуммаЗатратНУ"		, СтруктураПараметров.СуммаЗатратНУ);
	Запрос.УстановитьПараметр("СуммаЗатратПР"		, СтруктураПараметров.СуммаЗатратПР);
	Запрос.УстановитьПараметр("СуммаЗатратВР"		, СтруктураПараметров.СуммаЗатратВР);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ОбъектыНедвижимости.Ссылка КАК ОбъектНедвижимости
	               |ПОМЕСТИТЬ ВТОбъектыНедвижимости
	               |ИЗ
	               |	Справочник.АУН_ОбъектыНедвижимости КАК ОбъектыНедвижимости
	               |ГДЕ
	               |	ОбъектыНедвижимости.ОбъектЭксплуатации = &ОбъектСтроительства
	               |	И НЕ ОбъектыНедвижимости.ПометкаУдаления
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектНедвижимости
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
	               |	ЕСТЬNULL(ПлощадиОбъектовНедвижимости.ОбщаяПлощадь, 0) КАК ПлощадьПроектная,
	               |	ЕСТЬNULL(ПараметрыОбъектовНедвижимостиПоБТИ.ОбщаяПлощадь, 0) КАК ПлощадьФактическая
	               |ПОМЕСТИТЬ ВТПлощадиОбъектовНедвижимости
	               |ИЗ
	               |	ВТОбъектыНедвижимости КАК ВТОбъектыНедвижимости
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УПН_ПлощадиОбъектовНедвижимости.СрезПоследних(
	               |				&ДатаДокумента,
	               |				ОбъектНедвижимости В
	               |					(ВЫБРАТЬ
	               |						ВТОбъектыНедвижимости.ОбъектНедвижимости
	               |					ИЗ
	               |						ВТОбъектыНедвижимости)) КАК ПлощадиОбъектовНедвижимости
	               |		ПО ВТОбъектыНедвижимости.ОбъектНедвижимости = ПлощадиОбъектовНедвижимости.ОбъектНедвижимости
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УПН_ПараметрыОбъектовНедвижимостиПоБТИ.СрезПоследних(
	               |				&ДатаДокумента,
	               |				ОбъектНедвижимости В
	               |					(ВЫБРАТЬ
	               |						ВТОбъектыНедвижимости.ОбъектНедвижимости
	               |					ИЗ
	               |						ВТОбъектыНедвижимости)) КАК ПараметрыОбъектовНедвижимостиПоБТИ
	               |		ПО ВТОбъектыНедвижимости.ОбъектНедвижимости = ПараметрыОбъектовНедвижимостиПоБТИ.ОбъектНедвижимости
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектНедвижимости
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТПлощадиОбъектовНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
	               |	ВТПлощадиОбъектовНедвижимости.ПлощадьПроектная КАК ПлощадьПроектная,
	               |	ВТПлощадиОбъектовНедвижимости.ПлощадьФактическая КАК ПлощадьФактическая,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА &ПлощадьФактическая = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ВТПлощадиОбъектовНедвижимости.ПлощадьФактическая / &ПлощадьФактическая * &СуммаЗатрат
	               |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаЗатрат,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА &ПлощадьФактическая = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ВТПлощадиОбъектовНедвижимости.ПлощадьФактическая / &ПлощадьФактическая * &СуммаЗатратНУ
	               |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаЗатратНУ,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА &ПлощадьФактическая = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ВТПлощадиОбъектовНедвижимости.ПлощадьФактическая / &ПлощадьФактическая * &СуммаЗатратПР
	               |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаЗатратПР,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА &ПлощадьФактическая = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ВТПлощадиОбъектовНедвижимости.ПлощадьФактическая / &ПлощадьФактическая * &СуммаЗатратВР
	               |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаЗатратВР,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(СоответствиеДоговоровИДолей.Расторгнут, НЕОПРЕДЕЛЕНО) = ЛОЖЬ
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыОперацийСОбъектамиСтроительства.СдачаИнвестору)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыОперацийСОбъектамиСтроительства.ПринятиеКУчету)
	               |	КОНЕЦ КАК ВидОперации,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(СоответствиеДоговоровИДолей.Расторгнут, НЕОПРЕДЕЛЕНО) = ЛОЖЬ
	               |			ТОГДА СоответствиеДоговоровИДолей.Контрагент
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(СоответствиеДоговоровИДолей.Расторгнут, НЕОПРЕДЕЛЕНО) = ЛОЖЬ
	               |			ТОГДА СоответствиеДоговоровИДолей.Договор
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК Договор
	               |ИЗ
	               |	ВТПлощадиОбъектовНедвижимости КАК ВТПлощадиОбъектовНедвижимости
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_СоответствиеДоговоровИДолей.СрезПоследних(
	               |				&ДатаДокумента,
	               |				Доля В
	               |					(ВЫБРАТЬ
	               |						ВТОбъектыНедвижимости.ОбъектНедвижимости
	               |					ИЗ
	               |						ВТОбъектыНедвижимости)) КАК СоответствиеДоговоровИДолей
	               |		ПО ВТПлощадиОбъектовНедвижимости.ОбъектНедвижимости = СоответствиеДоговоровИДолей.Доля";
				   
	Возврат Запрос.Выполнить().Выгрузить();			   
				   
КонецФункции // ПолучитьДанныеЗаполненияОбъектовНедвижимости()

// Функция получает данные и возвращает таблицу значений для заполнения сведений о принятых к учету объектов недвижимости.
//
Функция ПолучитьДанныеЗаполненияПринятияКУчету(СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектыНедвижимости", СтруктураПараметров.ОбъектыНедвижимости);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
	               |	ОбъектыНедвижимости.ПлощадьПроектная КАК ПлощадьПроектная,
	               |	ОбъектыНедвижимости.ПлощадьФактическая КАК ПлощадьФактическая,
	               |	ОбъектыНедвижимости.СуммаЗатрат КАК СуммаЗатрат,
	               |	ОбъектыНедвижимости.СуммаЗатратНУ КАК СуммаЗатратНУ,
	               |	ОбъектыНедвижимости.СуммаЗатратПР КАК СуммаЗатратПР,
	               |	ОбъектыНедвижимости.СуммаЗатратВР КАК СуммаЗатратВР
	               |ПОМЕСТИТЬ ВТОбъектыНедвижимости
	               |ИЗ
	               |	&ОбъектыНедвижимости КАК ОбъектыНедвижимости
	               |ГДЕ
	               |	ОбъектыНедвижимости.ВидОперации = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыОперацийСОбъектамиСтроительства.ПринятиеКУчету)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектНедвижимости
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
	               |	СправочникОбъектыНедвижимости.Номенклатура КАК Номенклатура,
	               |	ВТОбъектыНедвижимости.ПлощадьПроектная КАК ПлощадьПроектная,
	               |	ВТОбъектыНедвижимости.ПлощадьФактическая КАК ПлощадьФактическая,
	               |	ВТОбъектыНедвижимости.СуммаЗатрат КАК СуммаЗатрат,
	               |	ВТОбъектыНедвижимости.СуммаЗатратНУ КАК СуммаЗатратНУ,
	               |	ВТОбъектыНедвижимости.СуммаЗатратПР КАК СуммаЗатратПР,
	               |	ВТОбъектыНедвижимости.СуммаЗатратВР КАК СуммаЗатратВР,
	               |	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция) КАК Счет
	               |ИЗ
	               |	ВТОбъектыНедвижимости КАК ВТОбъектыНедвижимости
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АУН_ОбъектыНедвижимости КАК СправочникОбъектыНедвижимости
	               |		ПО ВТОбъектыНедвижимости.ОбъектНедвижимости = СправочникОбъектыНедвижимости.Ссылка";
				   
	Возврат Запрос.Выполнить().Выгрузить();			   
				   
КонецФункции // ПолучитьДанныеЗаполненияПринятияКУчету()

// Функция получает данные и возвращает таблицу значений для заполнения сведений о сданных инвестору объектов недвижимости.
//
Функция ПолучитьДанныеЗаполненияСдачиИнвестору(СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"			, СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("ОбъектыНедвижимости"	, СтруктураПараметров.ОбъектыНедвижимости);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
	               |	ОбъектыНедвижимости.ПлощадьПроектная КАК ПлощадьПроектная,
	               |	ОбъектыНедвижимости.ПлощадьФактическая КАК ПлощадьФактическая,
	               |	ОбъектыНедвижимости.СуммаЗатрат КАК СуммаЗатрат,
	               |	ОбъектыНедвижимости.СуммаЗатратНУ КАК СуммаЗатратНУ,
	               |	ОбъектыНедвижимости.СуммаЗатратПР КАК СуммаЗатратПР,
	               |	ОбъектыНедвижимости.СуммаЗатратВР КАК СуммаЗатратВР,
	               |	ОбъектыНедвижимости.Контрагент КАК Контрагент,
	               |	ОбъектыНедвижимости.Договор КАК Договор
	               |ПОМЕСТИТЬ ВТОбъектыНедвижимости
	               |ИЗ
	               |	&ОбъектыНедвижимости КАК ОбъектыНедвижимости
	               |ГДЕ
	               |	ОбъектыНедвижимости.ВидОперации = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыОперацийСОбъектамиСтроительства.СдачаИнвестору)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
	               |	ВТОбъектыНедвижимости.ПлощадьПроектная КАК ПлощадьПроектная,
	               |	ВТОбъектыНедвижимости.ПлощадьФактическая КАК ПлощадьФактическая,
	               |	ВТОбъектыНедвижимости.СуммаЗатрат КАК СуммаЗатрат,
	               |	ВТОбъектыНедвижимости.СуммаЗатратНУ КАК СуммаЗатратНУ,
	               |	ВТОбъектыНедвижимости.СуммаЗатратПР КАК СуммаЗатратПР,
	               |	ВТОбъектыНедвижимости.СуммаЗатратВР КАК СуммаЗатратВР,
	               |	ПорядокОтраженияРасчетовСПартнерами.СчетУчетаРасчетовСКлиентами КАК СчетРасчетов,
	               |	ВТОбъектыНедвижимости.Контрагент КАК Контрагент,
	               |	ВТОбъектыНедвижимости.Договор КАК Договор
	               |ИЗ
	               |	ВТОбъектыНедвижимости КАК ВТОбъектыНедвижимости
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияРасчетовСПартнерами КАК ПорядокОтраженияРасчетовСПартнерами
	               |		ПО (ПорядокОтраженияРасчетовСПартнерами.Организация = &Организация)
	               |			И ВТОбъектыНедвижимости.Договор.ГруппаФинансовогоУчета = ПорядокОтраженияРасчетовСПартнерами.ГруппаФинансовогоУчета";
				   
	Возврат Запрос.Выполнить().Выгрузить();			   
				   
КонецФункции // ПолучитьДанныеЗаполненияСдачиИнвестору()

#КонецОбласти

#Область СозданиеНоменклатуры

// Процедура формирует список необходимой номенклатуры и создает ее, привязывая до объектов строительства.
//
Процедура СоздатьНоменклатуруДляОбъектовНедвижимости(СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаДокумента"		, СтруктураПараметров.ДатаДокумента);
	Запрос.УстановитьПараметр("Организация"			, СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("ГруппаНоменклатуры"	, СтруктураПараметров.ГруппаНоменклатуры);
	Запрос.УстановитьПараметр("ОбъектыНедвижимости"	, СтруктураПараметров.ОбъектыНедвижимости);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости
	               |ПОМЕСТИТЬ ВТОбъектыНедвижимости
	               |ИЗ
	               |	&ОбъектыНедвижимости КАК ОбъектыНедвижимости
	               |ГДЕ
	               |	ОбъектыНедвижимости.ВидОперации = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыОперацийСОбъектамиСтроительства.ПринятиеКУчету)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектНедвижимости
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	УчетнаяПолитикаПоДолевомуСтроительству.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	УчетнаяПолитикаПоДолевомуСтроительству.ГруппаНастроекФинУчетаНоменклатуры КАК ГруппаФинансовогоУчета,
	               |	УчетнаяПолитикаПоДолевомуСтроительству.ГруппаДоступаНоменклатуры КАК ГруппаДоступа,
	               |	УчетнаяПолитикаПоДолевомуСтроительству.ЕдиницаИзмеренияНоменклатуры КАК ЕдиницаИзмерения
	               |ПОМЕСТИТЬ ВТУчетнаяПолитикаПоДолевомуСтроительству
	               |ИЗ
	               |	РегистрСведений.УСОERP_УчетнаяПолитикаПоДолевомуСтроительству.СрезПоследних(&ДатаДокумента, Организация = &Организация) КАК УчетнаяПолитикаПоДолевомуСтроительству
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
	               |	СправочникОбъектыНедвижимости.Наименование КАК Наименование,
	               |	СправочникОбъектыНедвижимости.Наименование КАК НаименованиеПолное,
	               |	&ГруппаНоменклатуры КАК Родитель,
	               |	ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.Новый) КАК Качество,
	               |	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18) КАК СтавкаНДС,
	               |	ЕСТЬNULL(ВТУчетнаяПолитикаПоДолевомуСтроительству.ВидНоменклатуры, НЕОПРЕДЕЛЕНО) КАК ВидНоменклатуры,
	               |	ЕСТЬNULL(ВТУчетнаяПолитикаПоДолевомуСтроительству.ГруппаФинансовогоУчета, НЕОПРЕДЕЛЕНО) КАК ГруппаФинансовогоУчета,
	               |	ЕСТЬNULL(ВТУчетнаяПолитикаПоДолевомуСтроительству.ГруппаДоступа, НЕОПРЕДЕЛЕНО) КАК ГруппаДоступа,
	               |	ЕСТЬNULL(ВТУчетнаяПолитикаПоДолевомуСтроительству.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО) КАК ЕдиницаИзмерения
	               |ИЗ
	               |	ВТОбъектыНедвижимости КАК ВТОбъектыНедвижимости
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АУН_ОбъектыНедвижимости КАК СправочникОбъектыНедвижимости
	               |		ПО ВТОбъектыНедвижимости.ОбъектНедвижимости = СправочникОбъектыНедвижимости.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетнаяПолитикаПоДолевомуСтроительству КАК ВТУчетнаяПолитикаПоДолевомуСтроительству
	               |		ПО (ИСТИНА)
	               |ГДЕ
	               |	СправочникОбъектыНедвижимости.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ПроверитьЗаполнениеУчетнойПолитикиПоДолевомуСтроительству(Выборка, СтруктураПараметров) Тогда
			Возврат; // полностью выйдем с процедуры
		КонецЕсли;
		
		СписокИсключаемыхСвойств = "Ссылка, Владелец, ПометкаУдаления, ВерсияДанных, Предопределенный, ЭтоГруппа, Родитель, Описание, Наименование, Код, ИмяПредопределенныхДанных";
		НоменклатураНедвижимости = Справочники.Номенклатура.СоздатьЭлемент();
		
		ЗаполнитьЗначенияСвойств(НоменклатураНедвижимости, Выборка.ВидНоменклатуры, , СписокИсключаемыхСвойств);
		ЗаполнитьЗначенияСвойств(НоменклатураНедвижимости, Выборка);
		
		Попытка
			НоменклатураНедвижимости.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось создать номенклатуру """ + 
					Выборка.Наименование + """ по причине: '") + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Если Не ЗначениеЗаполнено(НоменклатураНедвижимости.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектНедвижимости = Выборка.ОбъектНедвижимости.ПолучитьОбъект();
		ОбъектНедвижимости.Номенклатура = НоменклатураНедвижимости.Ссылка;
		
		Попытка
			ОбъектНедвижимости.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось записать объект недвижимости """ + 
					ОбъектНедвижимости.Наименование + """ по причине: '") + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры // СоздатьНоменклатуруДляОбъектовНедвижимости()

// Функция проверяет заполнение учетной политики по долевому строительству и возвращает результат данной проверки.
//
Функция ПроверитьЗаполнениеУчетнойПолитикиПоДолевомуСтроительству(Выборка, СтруктураПараметров)
	
	УчетнойПолитикаЗаполнена = (Выборка.ВидНоменклатуры <> Неопределено);
	Если Не УчетнойПолитикаЗаполнена Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='На дату " + Формат(СтруктураПараметров.ДатаДокумента, "ДФ=dd.MM.yyyy") + " для организации """ +
				Строка(СтруктураПараметров.Организация) + """ не заполнен регистр ""Учетная политика по долевому строительству"", создание номенклатуры невозможно'"));
	КонецЕсли;
	
	Возврат УчетнойПолитикаЗаполнена;
	
КонецФункции // ПроверитьЗаполнениеУчетнойПолитикиПоДолевомуСтроительству()

#КонецОбласти

#Область ПроводкиРеглУчета

// Функция формирует и возвращает текст запроса для отражения документа в регламентированном учете.
//
Функция ТекстОтраженияВРеглУчете() Экспорт
	
	ПринятиеКУчету = "ВЫБРАТЬ
	                 |	Операция.Ссылка КАК Ссылка,
	                 |	Операция.Дата КАК Период,
	                 |	Операция.Организация КАК Организация,
	                 |	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	                 |	Строки.СуммаЗатрат КАК Сумма,
	                 |	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	                 |	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	                 |	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	                 |	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	                 |	Операция.Склад.Подразделение КАК ПодразделениеДт,
	                 |	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	                 |	Строки.Счет КАК СчетДт,
	                 |	Строки.Номенклатура КАК СубконтоДт1,
	                 |	Операция.Склад КАК СубконтоДт2,
	                 |	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	                 |	0 КАК ВалютнаяСуммаДт,
	                 |	1 КАК КоличествоДт,
	                 |	Строки.СуммаЗатратНУ КАК СуммаНУДт,
	                 |	Строки.СуммаЗатратПР КАК СуммаПРДт,
	                 |	Строки.СуммаЗатратВР КАК СуммаВРДт,
	                 |	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	                 |	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	                 |	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	                 |	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	                 |	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	                 |	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	                 |	Операция.Счет КАК СчетКт,
	                 |	Операция.ОбъектСтроительства КАК СубконтоКт1,
	                 |	Операция.ОбъектСтроительства.УСОERP_СпособСтроительства КАК СубконтоКт2,
	                 |	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	                 |	0 КАК ВалютнаяСуммаКт,
	                 |	0 КАК КоличествоКт,
	                 |	0 КАК СуммаНУКт,
	                 |	0 КАК СуммаПРКт,
	                 |	0 КАК СуммаВРКт,
	                 |	""Принятие к учету"" КАК Содержание
	                 |ИЗ
	                 |	Документ.УСОERP_ЗакрытиеОбъектаСтроительства КАК Операция
	                 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УСОERP_ЗакрытиеОбъектаСтроительства.ПринятиеКУчету КАК Строки
	                 |		ПО (Строки.Ссылка = Операция.Ссылка)
	                 |ГДЕ
	                 |	Операция.Ссылка = &Ссылка";
	
	СдачаИнвестору = "ВЫБРАТЬ
	                 |	Операция.Ссылка КАК Ссылка,
	                 |	Операция.Дата КАК Период,
	                 |	Операция.Организация КАК Организация,
	                 |	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	                 |	Строки.СуммаЗатрат КАК Сумма,
	                 |	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	                 |	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	                 |	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	                 |	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	                 |	Строки.Договор.Подразделение КАК ПодразделениеДт,
	                 |	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	                 |	Строки.СчетРасчетов КАК СчетДт,
	                 |	Строки.Контрагент КАК СубконтоДт1,
	                 |	Строки.Договор КАК СубконтоДт2,
	                 |	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	                 |	0 КАК ВалютнаяСуммаДт,
	                 |	0 КАК КоличествоДт,
	                 |	Строки.СуммаЗатратНУ КАК СуммаНУДт,
	                 |	Строки.СуммаЗатратПР КАК СуммаПРДт,
	                 |	Строки.СуммаЗатратВР КАК СуммаВРДт,
	                 |	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	                 |	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	                 |	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	                 |	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	                 |	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	                 |	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	                 |	Операция.Счет КАК СчетКт,
	                 |	Операция.ОбъектСтроительства КАК СубконтоКт1,
	                 |	Операция.ОбъектСтроительства.УСОERP_СпособСтроительства КАК СубконтоКт2,
	                 |	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	                 |	0 КАК ВалютнаяСуммаКт,
	                 |	0 КАК КоличествоКт,
	                 |	0 КАК СуммаНУКт,
	                 |	0 КАК СуммаПРКт,
	                 |	0 КАК СуммаВРКт,
	                 |	""Сдача инвестору"" КАК Содержание
	                 |ИЗ
	                 |	Документ.УСОERP_ЗакрытиеОбъектаСтроительства КАК Операция
	                 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УСОERP_ЗакрытиеОбъектаСтроительства.СдачаИнвестору КАК Строки
	                 |		ПО (Строки.Ссылка = Операция.Ссылка)
	                 |ГДЕ
	                 |	Операция.Ссылка = &Ссылка";
	
	ВосстановлениеНДС = "ВЫБРАТЬ
	                    |	Операция.Ссылка КАК Ссылка,
	                    |	Операция.Дата КАК Период,
	                    |	Операция.Организация КАК Организация,
	                    |	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	                    |	Строки.СуммаНДС КАК Сумма,
	                    |	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	                    |	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	                    |	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	                    |	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	                    |	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	                    |	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	                    |	УчетнаяПолитика.СчетУчетаИнвестиционногоНДС КАК СчетДт,
	                    |	Строки.Контрагент КАК СубконтоДт1,
	                    |	Строки.ДокументПоступления КАК СубконтоДт2,
	                    |	Строки.ОбъектСтроительства КАК СубконтоДт3,
	                    |	0 КАК ВалютнаяСуммаДт,
	                    |	0 КАК КоличествоДт,
	                    |	0 КАК СуммаНУДт,
	                    |	0 КАК СуммаПРДт,
	                    |	0 КАК СуммаВРДт,
	                    |	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	                    |	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	                    |	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	                    |	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	                    |	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	                    |	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	                    |	Операция.Счет КАК СчетКт,
	                    |	Операция.ОбъектСтроительства КАК СубконтоКт1,
	                    |	Операция.ОбъектСтроительства.УСОERP_СпособСтроительства КАК СубконтоКт2,
	                    |	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	                    |	0 КАК ВалютнаяСуммаКт,
	                    |	0 КАК КоличествоКт,
	                    |	0 КАК СуммаНУКт,
	                    |	0 КАК СуммаПРКт,
	                    |	0 КАК СуммаВРКт,
	                    |	""Восстановление НДС"" КАК Содержание
	                    |ИЗ
	                    |	Документ.УСОERP_ЗакрытиеОбъектаСтроительства КАК Операция
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УСОERP_ЗакрытиеОбъектаСтроительства.ВосстановлениеНДС КАК Строки
	                    |		ПО (Строки.Ссылка = Операция.Ссылка)
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_УчетнаяПолитикаПоДолевомуСтроительству.СрезПоследних(&Дата, ) КАК УчетнаяПолитика
	                    |		ПО Операция.Организация = УчетнаяПолитика.Организация
	                    |ГДЕ
	                    |	Операция.Ссылка = &Ссылка
	                    |	И Операция.ВосстанавливатьНДС";
	
	Возврат ПринятиеКУчету
	+ " ОБЪЕДИНИТЬ ВСЕ " + СдачаИнвестору
	+ " ОБЪЕДИНИТЬ ВСЕ " + ВосстановлениеНДС;

КонецФункции // ТекстОтраженияВРеглУчете()

// Функция возвращает текст запроса дополнительных временных таблиц, 
// необходимых для отражения в регламетированном учете
//
Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт
	
	ТекстЗапроса = "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Проведение

// Процедура инициализирует данные документа для их последующего отражения в связанных с документом регистрах.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ДокументСсылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеДокумента.Дата КАК Период,
	               |	ДанныеДокумента.Организация КАК Организация,
	               |	ДанныеДокумента.Склад КАК Склад
	               |ИЗ
	               |	Документ.УСОERP_ЗакрытиеОбъектаСтроительства КАК ДанныеДокумента
	               |ГДЕ
	               |	ДанныеДокумента.Ссылка = &ТекущийДокумент";
				   
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период"					   , Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация"				   , Реквизиты.Организация);
	Запрос.УстановитьПараметр("Склад"					   , Реквизиты.Склад);
	Запрос.УстановитьПараметр("УчитыватьПоВидамЗапасов"	   , ПолучитьФункциональнуюОпцию("УчитыватьСебестоимостьТоваровПоВидамЗапасов"));
	Запрос.УстановитьПараметр("ИспользоватьПартионныйУчет" , ПолучитьФункциональнуюОпцию("ИспользоватьПартионныйУчет"));

	Запрос.Текст = ТекстЗапросаТаблицаПринятиеКУчету()
				 + ТекстЗапросаТаблицаТоварыНаСкладах()
				 + ТекстЗапросаТаблицаСвободныеОстатки()
				 + ТекстЗапросаТаблицаСебестоимостьТоваров()
				 + ТекстЗапросаТаблицаТоварыОрганизаций()
				 + ТекстЗапросаТаблицаПартииТоваровОрганизаций()
				 + ТекстЗапросаТаблицаНДСИнвестиционный();
				 
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаТоварыНаСкладах"		  , Результат[1].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаСвободныеОстатки"		  , Результат[2].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаСебестоимостьТоваров"	  , Результат[3].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаТоварыОрганизаций"		  , Результат[4].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровОрганизаций" , Результат[5].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаНДСИнвестиционный"		  , Результат[6].Выгрузить());
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Функция формирует и возвращает текст запроса для подготовки виртуальной таблицы по табл. части "Принятие к учету".
//
Функция ТекстЗапросаТаблицаПринятиеКУчету()
	
	ТекстЗапроса = "ВЫБРАТЬ //// [0] ТаблицаПринятиеКУчету
	|	ТаблицаПринятиеКУчету.НомерСтроки КАК НомерСтроки,
	|	ТаблицаПринятиеКУчету.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	ТаблицаПринятиеКУчету.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	1 КАК Количество,
	|	ТаблицаПринятиеКУчету.СуммаЗатрат КАК Сумма,
	|	ТаблицаПринятиеКУчету.СуммаЗатрат КАК СуммаБезНДС,
	|	ТаблицаПринятиеКУчету.СуммаЗатратПР КАК СуммаПР,
	|	ТаблицаПринятиеКУчету.СуммаЗатратВР КАК СуммаВР,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка) КАК НомерГТД,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий
	|ПОМЕСТИТЬ ТаблицаПринятиеКУчету
	|ИЗ
	|	Документ.УСОERP_ЗакрытиеОбъектаСтроительства.ПринятиеКУчету КАК ТаблицаПринятиеКУчету
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
	//|		ПО ТаблицаПринятиеКУчету.Номенклатура = АналитикаУчетаНоменклатуры.Номенклатура
	//|			И (АналитикаУчетаНоменклатуры.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	//|			И (АналитикаУчетаНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	//|			И (АналитикаУчетаНоменклатуры.Склад = &Склад)
	|ГДЕ
	|	ТаблицаПринятиеКУчету.Ссылка = &ТекущийДокумент
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаТаблицаПринятиеКУчету()

// Функция формирует и возвращает текст запроса для проведения документа по регистру накопления "Товары на складах".
//
Функция ТекстЗапросаТаблицаТоварыНаСкладах()

	ТекстЗапроса = "ВЫБРАТЬ //// [1] ТоварыНаСкладах
	               |	ТаблицаПринятиеКУчету.НомерСтроки КАК НомерСтроки,
	               |	&Период КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	&Склад КАК Склад,
	               |	ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка) КАК Помещение,
	               |	ТаблицаПринятиеКУчету.Номенклатура КАК Номенклатура,
	               |	ТаблицаПринятиеКУчету.Характеристика КАК Характеристика,
	               |	ТаблицаПринятиеКУчету.Назначение КАК Назначение,
	               |	ТаблицаПринятиеКУчету.Серия КАК Серия,
	               |	ТаблицаПринятиеКУчету.Количество КАК ВНаличии
	               |ИЗ
	               |	ТаблицаПринятиеКУчету КАК ТаблицаПринятиеКУчету
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |;
	               |////////////////////////////////////////////////////////////////////////////////
	               |";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаТаблицаТоварыНаСкладах()

// Функция формирует и возвращает текст запроса для проведения документа по регистру накопления "Свободные остатки".
//
Функция ТекстЗапросаТаблицаСвободныеОстатки()
	
	ТекстЗапроса = "ВЫБРАТЬ //// [2] СвободныеОстатки
	               |	ТаблицаПринятиеКУчету.НомерСтроки КАК НомерСтроки,
	               |	&Период КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	&Склад КАК Склад,
	               |	ТаблицаПринятиеКУчету.Номенклатура КАК Номенклатура,
	               |	ТаблицаПринятиеКУчету.Характеристика КАК Характеристика,
	               |	ТаблицаПринятиеКУчету.Количество КАК ВНаличии
	               |ИЗ
	               |	ТаблицаПринятиеКУчету КАК ТаблицаПринятиеКУчету
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |;
	               |////////////////////////////////////////////////////////////////////////////////
	               |";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаТаблицаСвободныеОстатки()

// Функция формирует и возвращает текст запроса для проведения документа по регистру накопления "Себестоимость товаров".
//
Функция ТекстЗапросаТаблицаСебестоимостьТоваров()
	
	ТекстЗапроса = "ВЫБРАТЬ //// [3] СебестоимостьТоваров
	               |	ТаблицаПринятиеКУчету.НомерСтроки КАК НомерСтроки,
	               |	&Период КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	&Организация КАК Организация,
	               |	ТаблицаПринятиеКУчету.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах) КАК РазделУчета,
	               |	ВЫБОР
	               |		КОГДА &УчитыватьПоВидамЗапасов
	               |			ТОГДА ТаблицаПринятиеКУчету.ВидЗапасов
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК ВидЗапасов,
	               |	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеТоваров) КАК ХозяйственнаяОперация,
	               |	ТаблицаПринятиеКУчету.Сумма КАК Стоимость,
	               |	ТаблицаПринятиеКУчету.СуммаБезНДС КАК СтоимостьБезНДС,
	               |	ТаблицаПринятиеКУчету.Сумма КАК СтоимостьРегл,
	               |	ТаблицаПринятиеКУчету.СуммаПР КАК ПостояннаяРазница,
	               |	ТаблицаПринятиеКУчету.СуммаВР КАК ВременнаяРазница,
	               |	ТаблицаПринятиеКУчету.Количество КАК Количество
	               |ИЗ
	               |	ТаблицаПринятиеКУчету КАК ТаблицаПринятиеКУчету
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |;
	               |////////////////////////////////////////////////////////////////////////////////
	               |";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаТаблицаСебестоимостьТоваров()

// Функция формирует и возвращает текст запроса для проведения документа по регистру накопления "Товары организаций".
//
Функция ТекстЗапросаТаблицаТоварыОрганизаций()
	
	ТекстЗапроса = "ВЫБРАТЬ //// [4] ТоварыОрганизаций
	               |	ТаблицаПринятиеКУчету.НомерСтроки КАК НомерСтроки,
	               |	&Период КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	&Организация КАК Организация,
	               |	&Склад КАК Склад,
	               |	ТаблицаПринятиеКУчету.Номенклатура КАК Номенклатура,
	               |	ТаблицаПринятиеКУчету.Характеристика КАК Характеристика,
	               |	ТаблицаПринятиеКУчету.ВидЗапасов КАК ВидЗапасов,
	               |	ТаблицаПринятиеКУчету.НомерГТД КАК НомерГТД,
	               |	ТаблицаПринятиеКУчету.Количество КАК Количество,
	               |	ТаблицаПринятиеКУчету.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ИСТИНА КАК Первичное
	               |ИЗ
	               |	ТаблицаПринятиеКУчету КАК ТаблицаПринятиеКУчету
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |;
	               |////////////////////////////////////////////////////////////////////////////////
	               |";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаТаблицаТоварыОрганизаций()

// Функция формирует и возвращает текст запроса для проведения документа по регистру накопления "Партии товаров организаций".
//
Функция ТекстЗапросаТаблицаПартииТоваровОрганизаций()
	
	ТекстЗапроса = "ВЫБРАТЬ //// [5] ПартииТоваровОрганизаций
	               |	ТаблицаПринятиеКУчету.НомерСтроки КАК НомерСтроки,
	               |	&Период КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	&Организация КАК Организация,
	               |	ТаблицаПринятиеКУчету.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	&ТекущийДокумент КАК ДокументПоступления,
	               |	ТаблицаПринятиеКУчету.ВидЗапасов КАК ВидЗапасов,
	               |	ТаблицаПринятиеКУчету.Количество КАК Количество,
	               |	ТаблицаПринятиеКУчету.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	               |	ТаблицаПринятиеКУчету.Сумма КАК Стоимость,
	               |	ТаблицаПринятиеКУчету.СуммаБезНДС КАК СтоимостьБезНДС,
	               |	ТаблицаПринятиеКУчету.Сумма КАК СтоимостьРегл,
	               |	ТаблицаПринятиеКУчету.СуммаПР КАК ПостояннаяРазница,
	               |	ТаблицаПринятиеКУчету.СуммаВР КАК ВременнаяРазница,
	               |	0 КАК НДСРегл,
	               |	ТаблицаПринятиеКУчету.Номенклатура КАК Номенклатура,
	               |	ТаблицаПринятиеКУчету.Характеристика КАК Характеристика,
	               |	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК НалогообложениеНДС,
	               |	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеТоваров) КАК ХозяйственнаяОперация,
	               |	ИСТИНА КАК Первичное,
	               |	НЕОПРЕДЕЛЕНО КАК ДокументИсточник
	               |ИЗ
	               |	ТаблицаПринятиеКУчету КАК ТаблицаПринятиеКУчету
	               |ГДЕ
	               |	&ИспользоватьПартионныйУчет
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |;
	               |////////////////////////////////////////////////////////////////////////////////
	               |";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаТаблицаПартииТоваровОрганизаций()

// Функция формирует и возвращает текст запроса для проведения документа по регистру накопления "НДС инвестиционный".
//
Функция ТекстЗапросаТаблицаНДСИнвестиционный()
	
	ТекстЗапроса = "ВЫБРАТЬ //// [6] НДСИнвестиционный
	               |	ТаблицаНДСИнвестиционный.НомерСтроки КАК НомерСтроки,
	               |	&Период КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	&Организация КАК Организация,
	               |	ТаблицаНДСИнвестиционный.Контрагент КАК Контрагент,
	               |	ТаблицаНДСИнвестиционный.ДокументПоступления КАК ДокументПоступления,
	               |	ТаблицаНДСИнвестиционный.ОбъектСтроительства КАК ОбъектСтроительства,
	               |	ТаблицаНДСИнвестиционный.СчетУчетаНДС КАК СчетУчетаНДС,
	               |	ТаблицаНДСИнвестиционный.Номенклатура КАК Номенклатура,
	               |	ТаблицаНДСИнвестиционный.СпособСтроительства КАК СпособСтроительства,
	               |	ТаблицаНДСИнвестиционный.СуммаБезНДС КАК СуммаБезНДС,
	               |	ТаблицаНДСИнвестиционный.СуммаНДС КАК СуммаНДС
	               |ИЗ
	               |	Документ.УСОERP_ЗакрытиеОбъектаСтроительства.ВосстановлениеНДС КАК ТаблицаНДСИнвестиционный
	               |ГДЕ
	               |	ТаблицаНДСИнвестиционный.Ссылка = &ТекущийДокумент
	               |	И (ТаблицаНДСИнвестиционный.СуммаБезНДС <> 0
	               |			ИЛИ ТаблицаНДСИнвестиционный.СуммаНДС <> 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |;
	               |////////////////////////////////////////////////////////////////////////////////
	               |";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаТаблицаНДСИнвестиционный()

#КонецОбласти

#Область Отчеты
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти 

#Область СозданиеНаОсновании
// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт

	  Документы.УСОERP_РаспределениеИнвестиционногоНДС.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	  
КонецПроцедуры

#КонецОбласти


#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

#КонецОбласти

#КонецЕсли
